zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CANXL_RXFIFO.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CANXL_RXFIFO
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CANXL_RXFIFO_H_)  /* Check if memory map has not been already included */
#define S32K566_CANXL_RXFIFO_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CANXL_RXFIFO Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_RXFIFO_Peripheral_Access_Layer CANXL_RXFIFO Peripheral Access Layer
 * @{
 */

/** CANXL_RXFIFO - Size of Registers Arrays */
#define CANXL_RXFIFO_RXFFPOINTERAR_COUNT          32u
#define CANXL_RXFIFO_VCANACPTFLTAR_COUNT          16u
#define CANXL_RXFIFO_SDUACPTFLTAR_COUNT           16u
#define CANXL_RXFIFO_ADDRACPTFLTAR_COUNT          32u
#define CANXL_RXFIFO_IDACPTFLTAR_COUNT            32u

/** CANXL_RXFIFO - Register Layout Typedef */
typedef struct CANXL_RXFIFO_Struct {
  __IO uint32_t RXFFCTR;                           /**< Receive FIFO Message Buffer Control, offset: 0x0 */
  __IO uint32_t RXFMBP[CANXL_RXFIFO_RXFFPOINTERAR_COUNT]; /**< Receive FIFO Message Buffer Pointer, array offset: 0x4, array step: 0x4 */
  uint8_t RESERVED_0[116];
  __IO uint32_t SECAM;                             /**< SEC Acceptance Mask, offset: 0xF8 */
  __IO uint32_t SECAV;                             /**< SEC Acceptance Value, offset: 0xFC */
  __IO uint32_t AFCFG;                             /**< Acceptance Filter Configuration, offset: 0x100 */
  __IO uint32_t VAMRCFG;                           /**< VCAN Acceptance Mask or Range Configuration, offset: 0x104 */
  __IO uint32_t SAMRCFG;                           /**< SDU Acceptance Mask or Range Configuration, offset: 0x108 */
  __IO uint32_t AAMRCFG;                           /**< ADDR Acceptance Mask or Range Configuration, offset: 0x10C */
  __IO uint32_t ACPTIDMR;                          /**< ID Acceptance Mask or Range Configuration, offset: 0x110 */
  uint8_t RESERVED_1[16];
  __IO uint32_t VAFLT[CANXL_RXFIFO_VCANACPTFLTAR_COUNT]; /**< VCAN Acceptance Filter, array offset: 0x124, array step: 0x4 */
  __IO uint32_t SAFLT[CANXL_RXFIFO_SDUACPTFLTAR_COUNT]; /**< SDU Acceptance Filter, array offset: 0x164, array step: 0x4 */
  struct CANXL_RXFIFO_ADDRACPTFLTAR {              /* offset: 0x1A4, array step: 0x8 */
    __IO uint32_t AAFLTL;                            /**< ADDR Acceptance Filter Element Low, array offset: 0x1A4, array step: 0x8 */
    __IO uint32_t AAFLTH;                            /**< ADDR Acceptance Filter Element High, array offset: 0x1A8, array step: 0x8 */
  } ADDRACPTFLTAR[CANXL_RXFIFO_ADDRACPTFLTAR_COUNT];
  struct CANXL_RXFIFO_IDACPTFLTAR {                /* offset: 0x2A4, array step: 0x8 */
    __IO uint32_t IDAFLTL;                           /**< ID Acceptance Filter Element Low, array offset: 0x2A4, array step: 0x8 */
    __IO uint32_t IDAFLTH;                           /**< ID Acceptance Filter Element High, array offset: 0x2A8, array step: 0x8 */
  } IDACPTFLTAR[CANXL_RXFIFO_IDACPTFLTAR_COUNT];
} CANXL_RXFIFO_Type, *CANXL_RXFIFO_MemMapPtr;

/** Number of instances of the CANXL_RXFIFO module. */
#define CANXL_RXFIFO_INSTANCE_COUNT              (1u)

/* CANXL_RXFIFO - Peripheral instance base addresses */
/** Peripheral CANEXCEL__RXFIFO base address */
#define IP_CANEXCEL__RXFIFO_BASE                 (0x6A023000u)
/** Peripheral CANEXCEL__RXFIFO base pointer */
#define IP_CANEXCEL__RXFIFO                      ((CANXL_RXFIFO_Type *)IP_CANEXCEL__RXFIFO_BASE)
/** Array initializer of CANXL_RXFIFO peripheral base addresses */
#define IP_CANXL_RXFIFO_BASE_ADDRS               { IP_CANEXCEL__RXFIFO_BASE }
/** Array initializer of CANXL_RXFIFO peripheral base pointers */
#define IP_CANXL_RXFIFO_BASE_PTRS                { IP_CANEXCEL__RXFIFO }

/* ----------------------------------------------------------------------------
   -- CANXL_RXFIFO Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_RXFIFO_Register_Masks CANXL_RXFIFO Register Masks
 * @{
 */

/*! @name RXFFCTR - Receive FIFO Message Buffer Control */
/*! @{ */

#define CANXL_RXFIFO_RXFFCTR_MBSIZE_MASK         (0x7FFU)
#define CANXL_RXFIFO_RXFFCTR_MBSIZE_SHIFT        (0U)
#define CANXL_RXFIFO_RXFFCTR_MBSIZE_WIDTH        (11U)
#define CANXL_RXFIFO_RXFFCTR_MBSIZE(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_RXFFCTR_MBSIZE_SHIFT)) & CANXL_RXFIFO_RXFFCTR_MBSIZE_MASK)

