zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
#define CANXL_RXFIFO_RXFFCTR_KEEPLST_MASK        (0x8000U)
#define CANXL_RXFIFO_RXFFCTR_KEEPLST_SHIFT       (15U)
#define CANXL_RXFIFO_RXFFCTR_KEEPLST_WIDTH       (1U)
#define CANXL_RXFIFO_RXFFCTR_KEEPLST(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_RXFFCTR_KEEPLST_SHIFT)) & CANXL_RXFIFO_RXFFCTR_KEEPLST_MASK)
/*! @} */

/*! @name RXFMBP - Receive FIFO Message Buffer Pointer */
/*! @{ */

#define CANXL_RXFIFO_RXFMBP_RXPT_MASK            (0xFFFFFFFFU)
#define CANXL_RXFIFO_RXFMBP_RXPT_SHIFT           (0U)
#define CANXL_RXFIFO_RXFMBP_RXPT_WIDTH           (32U)
#define CANXL_RXFIFO_RXFMBP_RXPT(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_RXFMBP_RXPT_SHIFT)) & CANXL_RXFIFO_RXFMBP_RXPT_MASK)
/*! @} */

/*! @name SECAM - SEC Acceptance Mask */
/*! @{ */

#define CANXL_RXFIFO_SECAM_SECAM0_MASK           (0x1U)
#define CANXL_RXFIFO_SECAM_SECAM0_SHIFT          (0U)
#define CANXL_RXFIFO_SECAM_SECAM0_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM0(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM0_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM0_MASK)

#define CANXL_RXFIFO_SECAM_SECAM1_MASK           (0x2U)
#define CANXL_RXFIFO_SECAM_SECAM1_SHIFT          (1U)
#define CANXL_RXFIFO_SECAM_SECAM1_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM1(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM1_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM1_MASK)

#define CANXL_RXFIFO_SECAM_SECAM2_MASK           (0x4U)
#define CANXL_RXFIFO_SECAM_SECAM2_SHIFT          (2U)
#define CANXL_RXFIFO_SECAM_SECAM2_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM2(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM2_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM2_MASK)

#define CANXL_RXFIFO_SECAM_SECAM3_MASK           (0x8U)
#define CANXL_RXFIFO_SECAM_SECAM3_SHIFT          (3U)
#define CANXL_RXFIFO_SECAM_SECAM3_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM3(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM3_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM3_MASK)

#define CANXL_RXFIFO_SECAM_SECAM4_MASK           (0x10U)
#define CANXL_RXFIFO_SECAM_SECAM4_SHIFT          (4U)
#define CANXL_RXFIFO_SECAM_SECAM4_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM4(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM4_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM4_MASK)

#define CANXL_RXFIFO_SECAM_SECAM5_MASK           (0x20U)
#define CANXL_RXFIFO_SECAM_SECAM5_SHIFT          (5U)
#define CANXL_RXFIFO_SECAM_SECAM5_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM5(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM5_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM5_MASK)

#define CANXL_RXFIFO_SECAM_SECAM6_MASK           (0x40U)
#define CANXL_RXFIFO_SECAM_SECAM6_SHIFT          (6U)
#define CANXL_RXFIFO_SECAM_SECAM6_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM6(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM6_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM6_MASK)

#define CANXL_RXFIFO_SECAM_SECAM7_MASK           (0x80U)
#define CANXL_RXFIFO_SECAM_SECAM7_SHIFT          (7U)
#define CANXL_RXFIFO_SECAM_SECAM7_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM7(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM7_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM7_MASK)

#define CANXL_RXFIFO_SECAM_SECAM8_MASK           (0x100U)
#define CANXL_RXFIFO_SECAM_SECAM8_SHIFT          (8U)
#define CANXL_RXFIFO_SECAM_SECAM8_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM8(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM8_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM8_MASK)

#define CANXL_RXFIFO_SECAM_SECAM9_MASK           (0x200U)
#define CANXL_RXFIFO_SECAM_SECAM9_SHIFT          (9U)
#define CANXL_RXFIFO_SECAM_SECAM9_WIDTH          (1U)
#define CANXL_RXFIFO_SECAM_SECAM9(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM9_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM9_MASK)

#define CANXL_RXFIFO_SECAM_SECAM10_MASK          (0x400U)
#define CANXL_RXFIFO_SECAM_SECAM10_SHIFT         (10U)
#define CANXL_RXFIFO_SECAM_SECAM10_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM10(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM10_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM10_MASK)

#define CANXL_RXFIFO_SECAM_SECAM11_MASK          (0x800U)
#define CANXL_RXFIFO_SECAM_SECAM11_SHIFT         (11U)
#define CANXL_RXFIFO_SECAM_SECAM11_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM11(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM11_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM11_MASK)

#define CANXL_RXFIFO_SECAM_SECAM12_MASK          (0x1000U)
#define CANXL_RXFIFO_SECAM_SECAM12_SHIFT         (12U)
#define CANXL_RXFIFO_SECAM_SECAM12_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM12(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM12_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM12_MASK)

#define CANXL_RXFIFO_SECAM_SECAM13_MASK          (0x2000U)
#define CANXL_RXFIFO_SECAM_SECAM13_SHIFT         (13U)
#define CANXL_RXFIFO_SECAM_SECAM13_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM13(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM13_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM13_MASK)

#define CANXL_RXFIFO_SECAM_SECAM14_MASK          (0x4000U)
#define CANXL_RXFIFO_SECAM_SECAM14_SHIFT         (14U)
#define CANXL_RXFIFO_SECAM_SECAM14_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM14(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM14_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM14_MASK)

#define CANXL_RXFIFO_SECAM_SECAM15_MASK          (0x8000U)
#define CANXL_RXFIFO_SECAM_SECAM15_SHIFT         (15U)
#define CANXL_RXFIFO_SECAM_SECAM15_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM15(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM15_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM15_MASK)

#define CANXL_RXFIFO_SECAM_SECAM16_MASK          (0x10000U)
#define CANXL_RXFIFO_SECAM_SECAM16_SHIFT         (16U)
#define CANXL_RXFIFO_SECAM_SECAM16_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM16(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM16_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM16_MASK)

