zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
#define CANXL_RXFIFO_SECAM_SECAM17_MASK          (0x20000U)
#define CANXL_RXFIFO_SECAM_SECAM17_SHIFT         (17U)
#define CANXL_RXFIFO_SECAM_SECAM17_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM17(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM17_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM17_MASK)

#define CANXL_RXFIFO_SECAM_SECAM18_MASK          (0x40000U)
#define CANXL_RXFIFO_SECAM_SECAM18_SHIFT         (18U)
#define CANXL_RXFIFO_SECAM_SECAM18_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM18(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM18_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM18_MASK)

#define CANXL_RXFIFO_SECAM_SECAM19_MASK          (0x80000U)
#define CANXL_RXFIFO_SECAM_SECAM19_SHIFT         (19U)
#define CANXL_RXFIFO_SECAM_SECAM19_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM19(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM19_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM19_MASK)

#define CANXL_RXFIFO_SECAM_SECAM20_MASK          (0x100000U)
#define CANXL_RXFIFO_SECAM_SECAM20_SHIFT         (20U)
#define CANXL_RXFIFO_SECAM_SECAM20_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM20(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM20_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM20_MASK)

#define CANXL_RXFIFO_SECAM_SECAM21_MASK          (0x200000U)
#define CANXL_RXFIFO_SECAM_SECAM21_SHIFT         (21U)
#define CANXL_RXFIFO_SECAM_SECAM21_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM21(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM21_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM21_MASK)

#define CANXL_RXFIFO_SECAM_SECAM22_MASK          (0x400000U)
#define CANXL_RXFIFO_SECAM_SECAM22_SHIFT         (22U)
#define CANXL_RXFIFO_SECAM_SECAM22_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM22(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM22_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM22_MASK)

#define CANXL_RXFIFO_SECAM_SECAM23_MASK          (0x800000U)
#define CANXL_RXFIFO_SECAM_SECAM23_SHIFT         (23U)
#define CANXL_RXFIFO_SECAM_SECAM23_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM23(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM23_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM23_MASK)

#define CANXL_RXFIFO_SECAM_SECAM24_MASK          (0x1000000U)
#define CANXL_RXFIFO_SECAM_SECAM24_SHIFT         (24U)
#define CANXL_RXFIFO_SECAM_SECAM24_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM24(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM24_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM24_MASK)

#define CANXL_RXFIFO_SECAM_SECAM25_MASK          (0x2000000U)
#define CANXL_RXFIFO_SECAM_SECAM25_SHIFT         (25U)
#define CANXL_RXFIFO_SECAM_SECAM25_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM25(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM25_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM25_MASK)

#define CANXL_RXFIFO_SECAM_SECAM26_MASK          (0x4000000U)
#define CANXL_RXFIFO_SECAM_SECAM26_SHIFT         (26U)
#define CANXL_RXFIFO_SECAM_SECAM26_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM26(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM26_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM26_MASK)

#define CANXL_RXFIFO_SECAM_SECAM27_MASK          (0x8000000U)
#define CANXL_RXFIFO_SECAM_SECAM27_SHIFT         (27U)
#define CANXL_RXFIFO_SECAM_SECAM27_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM27(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM27_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM27_MASK)

#define CANXL_RXFIFO_SECAM_SECAM28_MASK          (0x10000000U)
#define CANXL_RXFIFO_SECAM_SECAM28_SHIFT         (28U)
#define CANXL_RXFIFO_SECAM_SECAM28_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM28(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM28_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM28_MASK)

#define CANXL_RXFIFO_SECAM_SECAM29_MASK          (0x20000000U)
#define CANXL_RXFIFO_SECAM_SECAM29_SHIFT         (29U)
#define CANXL_RXFIFO_SECAM_SECAM29_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM29(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM29_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM29_MASK)

#define CANXL_RXFIFO_SECAM_SECAM30_MASK          (0x40000000U)
#define CANXL_RXFIFO_SECAM_SECAM30_SHIFT         (30U)
#define CANXL_RXFIFO_SECAM_SECAM30_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM30(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM30_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM30_MASK)

#define CANXL_RXFIFO_SECAM_SECAM31_MASK          (0x80000000U)
#define CANXL_RXFIFO_SECAM_SECAM31_SHIFT         (31U)
#define CANXL_RXFIFO_SECAM_SECAM31_WIDTH         (1U)
#define CANXL_RXFIFO_SECAM_SECAM31(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAM_SECAM31_SHIFT)) & CANXL_RXFIFO_SECAM_SECAM31_MASK)
/*! @} */

/*! @name SECAV - SEC Acceptance Value */
/*! @{ */

#define CANXL_RXFIFO_SECAV_SECAV0_MASK           (0x1U)
#define CANXL_RXFIFO_SECAV_SECAV0_SHIFT          (0U)
#define CANXL_RXFIFO_SECAV_SECAV0_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV0(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV0_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV0_MASK)

#define CANXL_RXFIFO_SECAV_SECAV1_MASK           (0x2U)
#define CANXL_RXFIFO_SECAV_SECAV1_SHIFT          (1U)
#define CANXL_RXFIFO_SECAV_SECAV1_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV1(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV1_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV1_MASK)

#define CANXL_RXFIFO_SECAV_SECAV2_MASK           (0x4U)
#define CANXL_RXFIFO_SECAV_SECAV2_SHIFT          (2U)
#define CANXL_RXFIFO_SECAV_SECAV2_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV2(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV2_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV2_MASK)

#define CANXL_RXFIFO_SECAV_SECAV3_MASK           (0x8U)
#define CANXL_RXFIFO_SECAV_SECAV3_SHIFT          (3U)
#define CANXL_RXFIFO_SECAV_SECAV3_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV3(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV3_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV3_MASK)

#define CANXL_RXFIFO_SECAV_SECAV4_MASK           (0x10U)
#define CANXL_RXFIFO_SECAV_SECAV4_SHIFT          (4U)
#define CANXL_RXFIFO_SECAV_SECAV4_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV4(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV4_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV4_MASK)

#define CANXL_RXFIFO_SECAV_SECAV5_MASK           (0x20U)
#define CANXL_RXFIFO_SECAV_SECAV5_SHIFT          (5U)
#define CANXL_RXFIFO_SECAV_SECAV5_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV5(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV5_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV5_MASK)

#define CANXL_RXFIFO_SECAV_SECAV6_MASK           (0x40U)
#define CANXL_RXFIFO_SECAV_SECAV6_SHIFT          (6U)
#define CANXL_RXFIFO_SECAV_SECAV6_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV6(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV6_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV6_MASK)

