zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
#define CANXL_RXFIFO_SECAV_SECAV7_MASK           (0x80U)
#define CANXL_RXFIFO_SECAV_SECAV7_SHIFT          (7U)
#define CANXL_RXFIFO_SECAV_SECAV7_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV7(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV7_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV7_MASK)

#define CANXL_RXFIFO_SECAV_SECAV8_MASK           (0x100U)
#define CANXL_RXFIFO_SECAV_SECAV8_SHIFT          (8U)
#define CANXL_RXFIFO_SECAV_SECAV8_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV8(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV8_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV8_MASK)

#define CANXL_RXFIFO_SECAV_SECAV9_MASK           (0x200U)
#define CANXL_RXFIFO_SECAV_SECAV9_SHIFT          (9U)
#define CANXL_RXFIFO_SECAV_SECAV9_WIDTH          (1U)
#define CANXL_RXFIFO_SECAV_SECAV9(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV9_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV9_MASK)

#define CANXL_RXFIFO_SECAV_SECAV10_MASK          (0x400U)
#define CANXL_RXFIFO_SECAV_SECAV10_SHIFT         (10U)
#define CANXL_RXFIFO_SECAV_SECAV10_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV10(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV10_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV10_MASK)

#define CANXL_RXFIFO_SECAV_SECAV11_MASK          (0x800U)
#define CANXL_RXFIFO_SECAV_SECAV11_SHIFT         (11U)
#define CANXL_RXFIFO_SECAV_SECAV11_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV11(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV11_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV11_MASK)

#define CANXL_RXFIFO_SECAV_SECAV12_MASK          (0x1000U)
#define CANXL_RXFIFO_SECAV_SECAV12_SHIFT         (12U)
#define CANXL_RXFIFO_SECAV_SECAV12_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV12(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV12_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV12_MASK)

#define CANXL_RXFIFO_SECAV_SECAV13_MASK          (0x2000U)
#define CANXL_RXFIFO_SECAV_SECAV13_SHIFT         (13U)
#define CANXL_RXFIFO_SECAV_SECAV13_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV13(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV13_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV13_MASK)

#define CANXL_RXFIFO_SECAV_SECAV14_MASK          (0x4000U)
#define CANXL_RXFIFO_SECAV_SECAV14_SHIFT         (14U)
#define CANXL_RXFIFO_SECAV_SECAV14_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV14(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV14_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV14_MASK)

#define CANXL_RXFIFO_SECAV_SECAV15_MASK          (0x8000U)
#define CANXL_RXFIFO_SECAV_SECAV15_SHIFT         (15U)
#define CANXL_RXFIFO_SECAV_SECAV15_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV15(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV15_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV15_MASK)

#define CANXL_RXFIFO_SECAV_SECAV16_MASK          (0x10000U)
#define CANXL_RXFIFO_SECAV_SECAV16_SHIFT         (16U)
#define CANXL_RXFIFO_SECAV_SECAV16_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV16(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV16_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV16_MASK)

#define CANXL_RXFIFO_SECAV_SECAV17_MASK          (0x20000U)
#define CANXL_RXFIFO_SECAV_SECAV17_SHIFT         (17U)
#define CANXL_RXFIFO_SECAV_SECAV17_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV17(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV17_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV17_MASK)

#define CANXL_RXFIFO_SECAV_SECAV18_MASK          (0x40000U)
#define CANXL_RXFIFO_SECAV_SECAV18_SHIFT         (18U)
#define CANXL_RXFIFO_SECAV_SECAV18_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV18(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV18_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV18_MASK)

#define CANXL_RXFIFO_SECAV_SECAV19_MASK          (0x80000U)
#define CANXL_RXFIFO_SECAV_SECAV19_SHIFT         (19U)
#define CANXL_RXFIFO_SECAV_SECAV19_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV19(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV19_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV19_MASK)

#define CANXL_RXFIFO_SECAV_SECAV20_MASK          (0x100000U)
#define CANXL_RXFIFO_SECAV_SECAV20_SHIFT         (20U)
#define CANXL_RXFIFO_SECAV_SECAV20_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV20(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV20_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV20_MASK)

#define CANXL_RXFIFO_SECAV_SECAV21_MASK          (0x200000U)
#define CANXL_RXFIFO_SECAV_SECAV21_SHIFT         (21U)
#define CANXL_RXFIFO_SECAV_SECAV21_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV21(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV21_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV21_MASK)

#define CANXL_RXFIFO_SECAV_SECAV22_MASK          (0x400000U)
#define CANXL_RXFIFO_SECAV_SECAV22_SHIFT         (22U)
#define CANXL_RXFIFO_SECAV_SECAV22_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV22(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV22_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV22_MASK)

#define CANXL_RXFIFO_SECAV_SECAV23_MASK          (0x800000U)
#define CANXL_RXFIFO_SECAV_SECAV23_SHIFT         (23U)
#define CANXL_RXFIFO_SECAV_SECAV23_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV23(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV23_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV23_MASK)

#define CANXL_RXFIFO_SECAV_SECAV24_MASK          (0x1000000U)
#define CANXL_RXFIFO_SECAV_SECAV24_SHIFT         (24U)
#define CANXL_RXFIFO_SECAV_SECAV24_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV24(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV24_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV24_MASK)

#define CANXL_RXFIFO_SECAV_SECAV25_MASK          (0x2000000U)
#define CANXL_RXFIFO_SECAV_SECAV25_SHIFT         (25U)
#define CANXL_RXFIFO_SECAV_SECAV25_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV25(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV25_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV25_MASK)

#define CANXL_RXFIFO_SECAV_SECAV26_MASK          (0x4000000U)
#define CANXL_RXFIFO_SECAV_SECAV26_SHIFT         (26U)
#define CANXL_RXFIFO_SECAV_SECAV26_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV26(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV26_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV26_MASK)

#define CANXL_RXFIFO_SECAV_SECAV27_MASK          (0x8000000U)
#define CANXL_RXFIFO_SECAV_SECAV27_SHIFT         (27U)
#define CANXL_RXFIFO_SECAV_SECAV27_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV27(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV27_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV27_MASK)

#define CANXL_RXFIFO_SECAV_SECAV28_MASK          (0x10000000U)
#define CANXL_RXFIFO_SECAV_SECAV28_SHIFT         (28U)
#define CANXL_RXFIFO_SECAV_SECAV28_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV28(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV28_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV28_MASK)

#define CANXL_RXFIFO_SECAV_SECAV29_MASK          (0x20000000U)
#define CANXL_RXFIFO_SECAV_SECAV29_SHIFT         (29U)
#define CANXL_RXFIFO_SECAV_SECAV29_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV29(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV29_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV29_MASK)

