zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
#define CANXL_RXFIFO_SECAV_SECAV30_MASK          (0x40000000U)
#define CANXL_RXFIFO_SECAV_SECAV30_SHIFT         (30U)
#define CANXL_RXFIFO_SECAV_SECAV30_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV30(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV30_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV30_MASK)

#define CANXL_RXFIFO_SECAV_SECAV31_MASK          (0x80000000U)
#define CANXL_RXFIFO_SECAV_SECAV31_SHIFT         (31U)
#define CANXL_RXFIFO_SECAV_SECAV31_WIDTH         (1U)
#define CANXL_RXFIFO_SECAV_SECAV31(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SECAV_SECAV31_SHIFT)) & CANXL_RXFIFO_SECAV_SECAV31_MASK)
/*! @} */

/*! @name AFCFG - Acceptance Filter Configuration */
/*! @{ */

#define CANXL_RXFIFO_AFCFG_ACPTVCAN_MASK         (0x1FU)
#define CANXL_RXFIFO_AFCFG_ACPTVCAN_SHIFT        (0U)
#define CANXL_RXFIFO_AFCFG_ACPTVCAN_WIDTH        (5U)
#define CANXL_RXFIFO_AFCFG_ACPTVCAN(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AFCFG_ACPTVCAN_SHIFT)) & CANXL_RXFIFO_AFCFG_ACPTVCAN_MASK)

#define CANXL_RXFIFO_AFCFG_AVCANEN_MASK          (0x80U)
#define CANXL_RXFIFO_AFCFG_AVCANEN_SHIFT         (7U)
#define CANXL_RXFIFO_AFCFG_AVCANEN_WIDTH         (1U)
#define CANXL_RXFIFO_AFCFG_AVCANEN(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AFCFG_AVCANEN_SHIFT)) & CANXL_RXFIFO_AFCFG_AVCANEN_MASK)

#define CANXL_RXFIFO_AFCFG_ACPTSDU_MASK          (0x1F00U)
#define CANXL_RXFIFO_AFCFG_ACPTSDU_SHIFT         (8U)
#define CANXL_RXFIFO_AFCFG_ACPTSDU_WIDTH         (5U)
#define CANXL_RXFIFO_AFCFG_ACPTSDU(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AFCFG_ACPTSDU_SHIFT)) & CANXL_RXFIFO_AFCFG_ACPTSDU_MASK)

#define CANXL_RXFIFO_AFCFG_ASDUEN_MASK           (0x8000U)
#define CANXL_RXFIFO_AFCFG_ASDUEN_SHIFT          (15U)
#define CANXL_RXFIFO_AFCFG_ASDUEN_WIDTH          (1U)
#define CANXL_RXFIFO_AFCFG_ASDUEN(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AFCFG_ASDUEN_SHIFT)) & CANXL_RXFIFO_AFCFG_ASDUEN_MASK)

#define CANXL_RXFIFO_AFCFG_ACPTADDR_MASK         (0x1F0000U)
#define CANXL_RXFIFO_AFCFG_ACPTADDR_SHIFT        (16U)
#define CANXL_RXFIFO_AFCFG_ACPTADDR_WIDTH        (5U)
#define CANXL_RXFIFO_AFCFG_ACPTADDR(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AFCFG_ACPTADDR_SHIFT)) & CANXL_RXFIFO_AFCFG_ACPTADDR_MASK)

#define CANXL_RXFIFO_AFCFG_AADDREN_MASK          (0x800000U)
#define CANXL_RXFIFO_AFCFG_AADDREN_SHIFT         (23U)
#define CANXL_RXFIFO_AFCFG_AADDREN_WIDTH         (1U)
#define CANXL_RXFIFO_AFCFG_AADDREN(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AFCFG_AADDREN_SHIFT)) & CANXL_RXFIFO_AFCFG_AADDREN_MASK)

#define CANXL_RXFIFO_AFCFG_ACPTID_MASK           (0x1F000000U)
#define CANXL_RXFIFO_AFCFG_ACPTID_SHIFT          (24U)
#define CANXL_RXFIFO_AFCFG_ACPTID_WIDTH          (5U)
#define CANXL_RXFIFO_AFCFG_ACPTID(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AFCFG_ACPTID_SHIFT)) & CANXL_RXFIFO_AFCFG_ACPTID_MASK)
/*! @} */

/*! @name VAMRCFG - VCAN Acceptance Mask or Range Configuration */
/*! @{ */

#define CANXL_RXFIFO_VAMRCFG_VMSK0R0_MASK        (0x1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R0_SHIFT       (0U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R0_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R0(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R0_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R0_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R1_MASK        (0x2U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R1_SHIFT       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R1_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R1(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R1_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R1_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R2_MASK        (0x4U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R2_SHIFT       (2U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R2_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R2(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R2_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R2_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R3_MASK        (0x8U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R3_SHIFT       (3U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R3_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R3(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R3_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R3_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R4_MASK        (0x10U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R4_SHIFT       (4U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R4_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R4(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R4_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R4_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R5_MASK        (0x20U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R5_SHIFT       (5U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R5_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R5(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R5_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R5_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R6_MASK        (0x40U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R6_SHIFT       (6U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R6_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R6(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R6_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R6_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R7_MASK        (0x80U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R7_SHIFT       (7U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R7_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R7(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R7_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R7_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R8_MASK        (0x100U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R8_SHIFT       (8U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R8_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R8(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R8_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R8_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R9_MASK        (0x200U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R9_SHIFT       (9U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R9_WIDTH       (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R9(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R9_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R9_MASK)

#define CANXL_RXFIFO_VAMRCFG_VMSK0R10_MASK       (0x400U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R10_SHIFT      (10U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R10_WIDTH      (1U)
#define CANXL_RXFIFO_VAMRCFG_VMSK0R10(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAMRCFG_VMSK0R10_SHIFT)) & CANXL_RXFIFO_VAMRCFG_VMSK0R10_MASK)

