zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
#define CANXL_RXFIFO_SAMRCFG_SMSK0R25_MASK       (0x2000000U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R25_SHIFT      (25U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R25_WIDTH      (1U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R25(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAMRCFG_SMSK0R25_SHIFT)) & CANXL_RXFIFO_SAMRCFG_SMSK0R25_MASK)

#define CANXL_RXFIFO_SAMRCFG_SMSK0R26_MASK       (0x4000000U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R26_SHIFT      (26U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R26_WIDTH      (1U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R26(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAMRCFG_SMSK0R26_SHIFT)) & CANXL_RXFIFO_SAMRCFG_SMSK0R26_MASK)

#define CANXL_RXFIFO_SAMRCFG_SMSK0R27_MASK       (0x8000000U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R27_SHIFT      (27U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R27_WIDTH      (1U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R27(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAMRCFG_SMSK0R27_SHIFT)) & CANXL_RXFIFO_SAMRCFG_SMSK0R27_MASK)

#define CANXL_RXFIFO_SAMRCFG_SMSK0R28_MASK       (0x10000000U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R28_SHIFT      (28U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R28_WIDTH      (1U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R28(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAMRCFG_SMSK0R28_SHIFT)) & CANXL_RXFIFO_SAMRCFG_SMSK0R28_MASK)

#define CANXL_RXFIFO_SAMRCFG_SMSK0R29_MASK       (0x20000000U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R29_SHIFT      (29U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R29_WIDTH      (1U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R29(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAMRCFG_SMSK0R29_SHIFT)) & CANXL_RXFIFO_SAMRCFG_SMSK0R29_MASK)

#define CANXL_RXFIFO_SAMRCFG_SMSK0R30_MASK       (0x40000000U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R30_SHIFT      (30U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R30_WIDTH      (1U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R30(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAMRCFG_SMSK0R30_SHIFT)) & CANXL_RXFIFO_SAMRCFG_SMSK0R30_MASK)

#define CANXL_RXFIFO_SAMRCFG_SMSK0R31_MASK       (0x80000000U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R31_SHIFT      (31U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R31_WIDTH      (1U)
#define CANXL_RXFIFO_SAMRCFG_SMSK0R31(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAMRCFG_SMSK0R31_SHIFT)) & CANXL_RXFIFO_SAMRCFG_SMSK0R31_MASK)
/*! @} */

/*! @name AAMRCFG - ADDR Acceptance Mask or Range Configuration */
/*! @{ */

#define CANXL_RXFIFO_AAMRCFG_AMSK0R0_MASK        (0x1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R0_SHIFT       (0U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R0_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R0(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R0_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R0_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R1_MASK        (0x2U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R1_SHIFT       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R1_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R1(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R1_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R1_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R2_MASK        (0x4U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R2_SHIFT       (2U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R2_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R2(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R2_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R2_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R3_MASK        (0x8U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R3_SHIFT       (3U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R3_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R3(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R3_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R3_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R4_MASK        (0x10U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R4_SHIFT       (4U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R4_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R4(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R4_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R4_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R5_MASK        (0x20U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R5_SHIFT       (5U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R5_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R5(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R5_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R5_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R6_MASK        (0x40U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R6_SHIFT       (6U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R6_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R6(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R6_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R6_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R7_MASK        (0x80U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R7_SHIFT       (7U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R7_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R7(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R7_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R7_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R8_MASK        (0x100U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R8_SHIFT       (8U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R8_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R8(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R8_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R8_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R9_MASK        (0x200U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R9_SHIFT       (9U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R9_WIDTH       (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R9(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R9_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R9_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R10_MASK       (0x400U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R10_SHIFT      (10U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R10_WIDTH      (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R10(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R10_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R10_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R11_MASK       (0x800U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R11_SHIFT      (11U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R11_WIDTH      (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R11(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R11_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R11_MASK)

#define CANXL_RXFIFO_AAMRCFG_AMSK0R12_MASK       (0x1000U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R12_SHIFT      (12U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R12_WIDTH      (1U)
#define CANXL_RXFIFO_AAMRCFG_AMSK0R12(x)         (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAMRCFG_AMSK0R12_SHIFT)) & CANXL_RXFIFO_AAMRCFG_AMSK0R12_MASK)

