zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R6_MASK     (0x40U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R6_SHIFT    (6U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R6_WIDTH    (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R6(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R6_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R6_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R7_MASK     (0x80U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R7_SHIFT    (7U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R7_WIDTH    (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R7(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R7_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R7_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R8_MASK     (0x100U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R8_SHIFT    (8U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R8_WIDTH    (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R8(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R8_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R8_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R9_MASK     (0x200U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R9_SHIFT    (9U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R9_WIDTH    (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R9(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R9_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R9_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R10_MASK    (0x400U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R10_SHIFT   (10U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R10_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R10(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R10_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R10_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R11_MASK    (0x800U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R11_SHIFT   (11U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R11_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R11(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R11_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R11_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R12_MASK    (0x1000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R12_SHIFT   (12U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R12_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R12(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R12_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R12_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R13_MASK    (0x2000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R13_SHIFT   (13U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R13_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R13(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R13_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R13_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R14_MASK    (0x4000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R14_SHIFT   (14U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R14_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R14(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R14_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R14_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R15_MASK    (0x8000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R15_SHIFT   (15U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R15_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R15(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R15_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R15_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R16_MASK    (0x10000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R16_SHIFT   (16U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R16_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R16(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R16_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R16_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R17_MASK    (0x20000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R17_SHIFT   (17U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R17_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R17(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R17_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R17_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R18_MASK    (0x40000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R18_SHIFT   (18U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R18_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R18(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R18_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R18_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R19_MASK    (0x80000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R19_SHIFT   (19U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R19_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R19(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R19_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R19_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R20_MASK    (0x100000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R20_SHIFT   (20U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R20_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R20(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R20_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R20_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R21_MASK    (0x200000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R21_SHIFT   (21U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R21_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R21(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R21_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R21_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R22_MASK    (0x400000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R22_SHIFT   (22U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R22_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R22(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R22_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R22_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R23_MASK    (0x800000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R23_SHIFT   (23U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R23_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R23(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R23_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R23_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R24_MASK    (0x1000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R24_SHIFT   (24U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R24_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R24(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R24_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R24_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R25_MASK    (0x2000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R25_SHIFT   (25U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R25_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R25(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R25_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R25_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R26_MASK    (0x4000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R26_SHIFT   (26U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R26_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R26(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R26_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R26_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R27_MASK    (0x8000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R27_SHIFT   (27U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R27_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R27(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R27_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R27_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R28_MASK    (0x10000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R28_SHIFT   (28U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R28_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R28(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R28_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R28_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R29_MASK    (0x20000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R29_SHIFT   (29U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R29_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R29(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R29_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R29_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R30_MASK    (0x40000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R30_SHIFT   (30U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R30_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R30(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R30_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R30_MASK)

#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R31_MASK    (0x80000000U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R31_SHIFT   (31U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R31_WIDTH   (1U)
#define CANXL_RXFIFO_ACPTIDMR_IDAMSK0R31(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_ACPTIDMR_IDAMSK0R31_SHIFT)) & CANXL_RXFIFO_ACPTIDMR_IDAMSK0R31_MASK)
/*! @} */

