zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_RXFIFO.h
/*! @name VAFLT - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_RXFIFO_VAFLT_VCANa_L_MASK          (0xFFU)
#define CANXL_RXFIFO_VAFLT_VCANa_L_SHIFT         (0U)
#define CANXL_RXFIFO_VAFLT_VCANa_L_WIDTH         (8U)
#define CANXL_RXFIFO_VAFLT_VCANa_L(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAFLT_VCANa_L_SHIFT)) & CANXL_RXFIFO_VAFLT_VCANa_L_MASK)

#define CANXL_RXFIFO_VAFLT_VCANa_H_MASK          (0xFF00U)
#define CANXL_RXFIFO_VAFLT_VCANa_H_SHIFT         (8U)
#define CANXL_RXFIFO_VAFLT_VCANa_H_WIDTH         (8U)
#define CANXL_RXFIFO_VAFLT_VCANa_H(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAFLT_VCANa_H_SHIFT)) & CANXL_RXFIFO_VAFLT_VCANa_H_MASK)

#define CANXL_RXFIFO_VAFLT_VCANb_L_MASK          (0xFF0000U)
#define CANXL_RXFIFO_VAFLT_VCANb_L_SHIFT         (16U)
#define CANXL_RXFIFO_VAFLT_VCANb_L_WIDTH         (8U)
#define CANXL_RXFIFO_VAFLT_VCANb_L(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAFLT_VCANb_L_SHIFT)) & CANXL_RXFIFO_VAFLT_VCANb_L_MASK)

#define CANXL_RXFIFO_VAFLT_VCANb_H_MASK          (0xFF000000U)
#define CANXL_RXFIFO_VAFLT_VCANb_H_SHIFT         (24U)
#define CANXL_RXFIFO_VAFLT_VCANb_H_WIDTH         (8U)
#define CANXL_RXFIFO_VAFLT_VCANb_H(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_VAFLT_VCANb_H_SHIFT)) & CANXL_RXFIFO_VAFLT_VCANb_H_MASK)
/*! @} */

/*! @name SAFLT - SDU Acceptance Filter */
/*! @{ */

#define CANXL_RXFIFO_SAFLT_SDUa_L_MASK           (0xFFU)
#define CANXL_RXFIFO_SAFLT_SDUa_L_SHIFT          (0U)
#define CANXL_RXFIFO_SAFLT_SDUa_L_WIDTH          (8U)
#define CANXL_RXFIFO_SAFLT_SDUa_L(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAFLT_SDUa_L_SHIFT)) & CANXL_RXFIFO_SAFLT_SDUa_L_MASK)

#define CANXL_RXFIFO_SAFLT_SDUa_H_MASK           (0xFF00U)
#define CANXL_RXFIFO_SAFLT_SDUa_H_SHIFT          (8U)
#define CANXL_RXFIFO_SAFLT_SDUa_H_WIDTH          (8U)
#define CANXL_RXFIFO_SAFLT_SDUa_H(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAFLT_SDUa_H_SHIFT)) & CANXL_RXFIFO_SAFLT_SDUa_H_MASK)

#define CANXL_RXFIFO_SAFLT_SDUb_L_MASK           (0xFF0000U)
#define CANXL_RXFIFO_SAFLT_SDUb_L_SHIFT          (16U)
#define CANXL_RXFIFO_SAFLT_SDUb_L_WIDTH          (8U)
#define CANXL_RXFIFO_SAFLT_SDUb_L(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAFLT_SDUb_L_SHIFT)) & CANXL_RXFIFO_SAFLT_SDUb_L_MASK)

#define CANXL_RXFIFO_SAFLT_SDUb_H_MASK           (0xFF000000U)
#define CANXL_RXFIFO_SAFLT_SDUb_H_SHIFT          (24U)
#define CANXL_RXFIFO_SAFLT_SDUb_H_WIDTH          (8U)
#define CANXL_RXFIFO_SAFLT_SDUb_H(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_SAFLT_SDUb_H_SHIFT)) & CANXL_RXFIFO_SAFLT_SDUb_H_MASK)
/*! @} */

/*! @name AAFLTL - ADDR Acceptance Filter Element Low */
/*! @{ */

#define CANXL_RXFIFO_AAFLTL_ADDRn_L_MASK         (0xFFFFFFFFU)
#define CANXL_RXFIFO_AAFLTL_ADDRn_L_SHIFT        (0U)
#define CANXL_RXFIFO_AAFLTL_ADDRn_L_WIDTH        (32U)
#define CANXL_RXFIFO_AAFLTL_ADDRn_L(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAFLTL_ADDRn_L_SHIFT)) & CANXL_RXFIFO_AAFLTL_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLTH - ADDR Acceptance Filter Element High */
/*! @{ */

#define CANXL_RXFIFO_AAFLTH_ADDRn_H_MASK         (0xFFFFFFFFU)
#define CANXL_RXFIFO_AAFLTH_ADDRn_H_SHIFT        (0U)
#define CANXL_RXFIFO_AAFLTH_ADDRn_H_WIDTH        (32U)
#define CANXL_RXFIFO_AAFLTH_ADDRn_H(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_AAFLTH_ADDRn_H_SHIFT)) & CANXL_RXFIFO_AAFLTH_ADDRn_H_MASK)
/*! @} */

/*! @name IDAFLTL - ID Acceptance Filter Element Low */
/*! @{ */

#define CANXL_RXFIFO_IDAFLTL_IDEXTENDn_L_MASK    (0x3FFFFU)
#define CANXL_RXFIFO_IDAFLTL_IDEXTENDn_L_SHIFT   (0U)
#define CANXL_RXFIFO_IDAFLTL_IDEXTENDn_L_WIDTH   (18U)
#define CANXL_RXFIFO_IDAFLTL_IDEXTENDn_L(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTL_IDEXTENDn_L_SHIFT)) & CANXL_RXFIFO_IDAFLTL_IDEXTENDn_L_MASK)

#define CANXL_RXFIFO_IDAFLTL_IDSTANDn_L_MASK     (0x1FFC0000U)
#define CANXL_RXFIFO_IDAFLTL_IDSTANDn_L_SHIFT    (18U)
#define CANXL_RXFIFO_IDAFLTL_IDSTANDn_L_WIDTH    (11U)
#define CANXL_RXFIFO_IDAFLTL_IDSTANDn_L(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTL_IDSTANDn_L_SHIFT)) & CANXL_RXFIFO_IDAFLTL_IDSTANDn_L_MASK)

#define CANXL_RXFIFO_IDAFLTL_IDEn_L_MASK         (0x40000000U)
#define CANXL_RXFIFO_IDAFLTL_IDEn_L_SHIFT        (30U)
#define CANXL_RXFIFO_IDAFLTL_IDEn_L_WIDTH        (1U)
#define CANXL_RXFIFO_IDAFLTL_IDEn_L(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTL_IDEn_L_SHIFT)) & CANXL_RXFIFO_IDAFLTL_IDEn_L_MASK)

#define CANXL_RXFIFO_IDAFLTL_RTRn_L_MASK         (0x80000000U)
#define CANXL_RXFIFO_IDAFLTL_RTRn_L_SHIFT        (31U)
#define CANXL_RXFIFO_IDAFLTL_RTRn_L_WIDTH        (1U)
#define CANXL_RXFIFO_IDAFLTL_RTRn_L(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTL_RTRn_L_SHIFT)) & CANXL_RXFIFO_IDAFLTL_RTRn_L_MASK)
/*! @} */

/*! @name IDAFLTH - ID Acceptance Filter Element High */
/*! @{ */

#define CANXL_RXFIFO_IDAFLTH_IDEXTENDn_H_MASK    (0x3FFFFU)
#define CANXL_RXFIFO_IDAFLTH_IDEXTENDn_H_SHIFT   (0U)
#define CANXL_RXFIFO_IDAFLTH_IDEXTENDn_H_WIDTH   (18U)
#define CANXL_RXFIFO_IDAFLTH_IDEXTENDn_H(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTH_IDEXTENDn_H_SHIFT)) & CANXL_RXFIFO_IDAFLTH_IDEXTENDn_H_MASK)

#define CANXL_RXFIFO_IDAFLTH_IDSTANDn_H_MASK     (0x1FFC0000U)
#define CANXL_RXFIFO_IDAFLTH_IDSTANDn_H_SHIFT    (18U)
#define CANXL_RXFIFO_IDAFLTH_IDSTANDn_H_WIDTH    (11U)
#define CANXL_RXFIFO_IDAFLTH_IDSTANDn_H(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTH_IDSTANDn_H_SHIFT)) & CANXL_RXFIFO_IDAFLTH_IDSTANDn_H_MASK)

#define CANXL_RXFIFO_IDAFLTH_IDEn_H_MASK         (0x40000000U)
#define CANXL_RXFIFO_IDAFLTH_IDEn_H_SHIFT        (30U)
#define CANXL_RXFIFO_IDAFLTH_IDEn_H_WIDTH        (1U)
#define CANXL_RXFIFO_IDAFLTH_IDEn_H(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTH_IDEn_H_SHIFT)) & CANXL_RXFIFO_IDAFLTH_IDEn_H_MASK)

#define CANXL_RXFIFO_IDAFLTH_RTRn_H_MASK         (0x80000000U)
#define CANXL_RXFIFO_IDAFLTH_RTRn_H_SHIFT        (31U)
#define CANXL_RXFIFO_IDAFLTH_RTRn_H_WIDTH        (1U)
#define CANXL_RXFIFO_IDAFLTH_RTRn_H(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_RXFIFO_IDAFLTH_RTRn_H_SHIFT)) & CANXL_RXFIFO_IDAFLTH_RTRn_H_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CANXL_RXFIFO_Register_Masks */

/*!
 * @}
 */ /* end of group CANXL_RXFIFO_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CANXL_RXFIFO_H_) */
